tests/Unit/Api/Subscriptions/data/responses/subscription_billing_profile_overrode.json

{
  "subscription": {
    "id": "8avVGOkx8U1MX",
    "customer_id": "8avVGOkx8U1MX",
    "plan_id": "basic",
    "plan_quantity": 1,
    "plan_unit_price": 900,
    "billing_period": 1,
    "billing_period_unit": "month",
    "plan_free_quantity": 0,
    "status": "active",
    "trial_start": 1412101845,
    "trial_end": 1414780245,
    "current_term_start": 1506418808,
    "current_term_end": 1509010808,
    "next_billing_at": 1511689208,
    "created_at": 1412101845,
    "started_at": 1412101845,
    "activated_at": 1506418808,
    "updated_at": 1506418812,
    "has_scheduled_changes": false,
    "payment_source_id": "pm_XpbBroXQF5m78F6",
    "resource_version": 1506418812000,
    "deleted": false,
    "object": "subscription",
    "currency_code": "USD",
    "due_invoices_count": 2,
    "due_since": 1394532759,
    "total_dues": 5800,
    "mrr": 900,
    "exchange_rate": 1.0,
    "base_currency_code": "USD",
    "shipping_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state_code": "CA",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "shipping_address"
    }
  },
  "payment_source": {
    "id": "pm_XpbBroXQF5m78F6",
    "object": "payment_source",
    "customer_id": "8avVGOkx8U1MX",
    "type": "card",
    "reference_id": "tok_3Nl8LcOQWK2SPtG",
    "status": "valid",
    "gateway": "chargebee",
    "gateway_account_id": "gw_3Nl8LcOQWK2N9I2",
    "card": {
      "iin": "385200",
      "last4": "3237",
      "funding_type": "not_known",
      "expiry_month": 12,
      "expiry_year": 2022,
      "masked_number": "************3237",
      "object": "card",
      "brand": "diners_club"
    }
  }
}