tests/Unit/Api/Subscriptions/data/responses/subscription_deleted.json

{
  "subscription": {
    "id": "5cDfREwp3I5lJ",
    "customer_id": "5cDfREwp3I5lJ",
    "plan_id": "basic",
    "plan_quantity": 1,
    "plan_unit_price": 900,
    "billing_period": 1,
    "billing_period_unit": "month",
    "plan_free_quantity": 0,
    "status": "active",
    "trial_start": 1506418524,
    "trial_end": 1506252925,
    "current_term_start": 1506252925,
    "current_term_end": 1508844925,
    "next_billing_at": 1508844925,
    "created_at": 1506418524,
    "started_at": 1506418524,
    "activated_at": 1506252925,
    "updated_at": 1506418525,
    "has_scheduled_changes": false,
    "resource_version": 1506418525000,
    "deleted": false,
    "object": "subscription",
    "currency_code": "USD",
    "due_invoices_count": 1,
    "due_since": 1506252925,
    "total_dues": 900,
    "mrr": 900,
    "exchange_rate": 1.0,
    "base_currency_code": "USD"
  },
  "customer": {
    "id": "5cDfREwp3I5lJ",
    "first_name": "David",
    "last_name": "White",
    "email": "David@test.com",
    "auto_collection": "on",
    "net_term_days": 0,
    "allow_direct_debit": false,
    "created_at": 1506418524,
    "taxability": "taxable",
    "updated_at": 1506245725,
    "resource_version": 1506245725000,
    "deleted": false,
    "object": "customer",
    "card_status": "valid",
    "primary_payment_source_id": "pm_3Nl8LcOQWK2c1u64",
    "payment_method": {
      "object": "payment_method",
      "type": "card",
      "reference_id": "tok_3Nl8LcOQWK2c1i63",
      "gateway": "chargebee",
      "gateway_account_id": "gw_3Nl8LcOQWK2N9I2",
      "status": "valid"
    },
    "promotional_credits": 0,
    "refundable_credits": 0,
    "excess_payments": 0,
    "unbilled_charges": 0,
    "preferred_currency_code": "USD"
  },
  "card": {
    "status": "valid",
    "gateway": "chargebee",
    "gateway_account_id": "gw_3Nl8LcOQWK2N9I2",
    "iin": "400551",
    "last4": "0004",
    "card_type": "visa",
    "funding_type": "not_known",
    "expiry_month": 12,
    "expiry_year": 2022,
    "object": "card",
    "masked_number": "************0004",
    "customer_id": "5cDfREwp3I5lJ",
    "payment_source_id": "pm_3Nl8LcOQWK2c1u64"
  }
}