tests/Unit/Api/Subscriptions/data/responses/subscription_reactivated.json

{
  "subscription": {
    "id": "8avVGOkx8U1MX",
    "customer_id": "8avVGOkx8U1MX",
    "plan_id": "basic",
    "plan_quantity": 1,
    "plan_unit_price": 900,
    "billing_period": 1,
    "billing_period_unit": "month",
    "plan_free_quantity": 0,
    "status": "active",
    "trial_start": 1412101845,
    "trial_end": 1414780245,
    "current_term_start": 1506418808,
    "current_term_end": 1509010808,
    "next_billing_at": 1509010808,
    "created_at": 1412101845,
    "started_at": 1412101845,
    "activated_at": 1506418808,
    "updated_at": 1506418809,
    "has_scheduled_changes": false,
    "resource_version": 1506418809000,
    "deleted": false,
    "object": "subscription",
    "currency_code": "USD",
    "due_invoices_count": 2,
    "due_since": 1394532759,
    "total_dues": 5800,
    "mrr": 900,
    "exchange_rate": 1.0,
    "base_currency_code": "USD",
    "shipping_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state_code": "CA",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "shipping_address"
    }
  },
  "customer": {
    "id": "8avVGOkx8U1MX",
    "first_name": "Benjamin",
    "last_name": "Ross",
    "email": "Benjamin@test.com",
    "auto_collection": "on",
    "net_term_days": 0,
    "allow_direct_debit": false,
    "created_at": 1412101845,
    "taxability": "taxable",
    "updated_at": 1506418807,
    "resource_version": 1506418807000,
    "deleted": false,
    "object": "customer",
    "billing_address": {
      "first_name": "John",
      "last_name": "Doe",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state_code": "CA",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "billing_address"
    },
    "card_status": "valid",
    "contacts": [
      {
        "id": "d334f4g45",
        "first_name": "aasca",
        "last_name": "asas",
        "email": "sss@wss.asc",
        "label": "ascasc",
        "enabled": true,
        "send_account_email": true,
        "send_billing_email": false,
        "object": "contact"
      }
    ],
    "primary_payment_source_id": "pm_3Nl8LlrQWK3lpy6b",
    "payment_method": {
      "object": "payment_method",
      "type": "card",
      "reference_id": "cus_BTBvy1z4X6JLhe/card_BTBvztp7M258n7",
      "gateway": "stripe",
      "gateway_account_id": "gw_3Nl8LcOQWK2o5b7N",
      "status": "valid"
    },
    "balances": [
      {
        "promotional_credits": 0,
        "excess_payments": 0,
        "refundable_credits": 0,
        "unbilled_charges": 0,
        "object": "customer_balance",
        "currency_code": "USD"
      }
    ],
    "promotional_credits": 0,
    "refundable_credits": 0,
    "excess_payments": 0,
    "unbilled_charges": 0,
    "preferred_currency_code": "USD"
  },
  "card": {
    "status": "valid",
    "gateway": "stripe",
    "gateway_account_id": "gw_3Nl8LcOQWK2o5b7N",
    "first_name": "Richard",
    "last_name": "Fox",
    "iin": "401288",
    "last4": "1881",
    "card_type": "visa",
    "funding_type": "credit",
    "expiry_month": 10,
    "expiry_year": 2022,
    "issuing_country": "CA",
    "object": "card",
    "masked_number": "************1881",
    "customer_id": "8avVGOkx8U1MX",
    "payment_source_id": "pm_3Nl8LlrQWK3lpy6b"
  },
  "invoice": {
    "id": "67",
    "customer_id": "8avVGOkx8U1MX",
    "subscription_id": "8avVGOkx8U1MX",
    "recurring": true,
    "status": "paid",
    "price_type": "tax_exclusive",
    "date": 1506418808,
    "due_date": 1506418808,
    "net_term_days": 0,
    "exchange_rate": 1.0,
    "total": 900,
    "amount_paid": 900,
    "amount_adjusted": 0,
    "write_off_amount": 0,
    "credits_applied": 0,
    "amount_due": 0,
    "paid_at": 1506418809,
    "updated_at": 1506418809,
    "resource_version": 1506418809000,
    "deleted": false,
    "object": "invoice",
    "first_invoice": false,
    "amount_to_collect": 0,
    "has_advance_charges": false,
    "currency_code": "USD",
    "base_currency_code": "USD",
    "tax": 0,
    "line_items": [
      {
        "id": "li_3Nl8LlrQWK3naL7G",
        "date_from": 1506418808,
        "date_to": 1509010808,
        "unit_amount": 900,
        "quantity": 1,
        "is_taxed": false,
        "tax_amount": 0,
        "object": "line_item",
        "subscription_id": "8avVGOkx8U1MX",
        "amount": 900,
        "description": "sample plan",
        "entity_type": "plan",
        "entity_id": "basic",
        "tax_exempt_reason": "tax_not_configured",
        "discount_amount": 0,
        "item_level_discount_amount": 0
      }
    ],
    "sub_total": 900,
    "linked_payments": [
      {
        "txn_id": "txn_3Nl8LlrQWK3nbR7H",
        "applied_amount": 900,
        "applied_at": 1506418809,
        "txn_status": "success",
        "txn_date": 1506418809,
        "txn_amount": 900
      }
    ],
    "applied_credits": [],
    "adjustment_credit_notes": [],
    "issued_credit_notes": [],
    "linked_orders": [],
    "billing_address": {
      "first_name": "John",
      "last_name": "Doe",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state_code": "CA",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "billing_address"
    },
    "shipping_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state_code": "CA",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "shipping_address"
    }
  }
}