tests/Unit/Api/Subscriptions/data/responses/subscription_scheduled_changes_removed.json

{
  "subscription": {
    "id": "8avVGOkx8U1MX",
    "customer_id": "8avVGOkx8U1MX",
    "plan_id": "basic",
    "plan_quantity": 1,
    "plan_unit_price": 900,
    "billing_period": 1,
    "billing_period_unit": "month",
    "plan_free_quantity": 0,
    "status": "non_renewing",
    "trial_start": 1412101845,
    "trial_end": 1414780245,
    "current_term_start": 1504204245,
    "current_term_end": 1506796245,
    "remaining_billing_cycles": 0,
    "created_at": 1412101845,
    "started_at": 1412101845,
    "activated_at": 1414780245,
    "cancelled_at": 1506796245,
    "updated_at": 1506418806,
    "has_scheduled_changes": false,
    "resource_version": 1506418806000,
    "deleted": false,
    "object": "subscription",
    "currency_code": "USD",
    "due_invoices_count": 2,
    "due_since": 1394532759,
    "total_dues": 5800,
    "mrr": 900,
    "exchange_rate": 1.0,
    "base_currency_code": "USD",
    "shipping_address": {
      "first_name": "Benjamin",
      "last_name": "Ross",
      "line1": "PO Box 9999",
      "city": "Walnut",
      "state_code": "CA",
      "state": "California",
      "country": "US",
      "zip": "91789",
      "validation_status": "not_validated",
      "object": "shipping_address"
    }
  },
  "customer": {
    "id": "8avVGOkx8U1MX",
    "first_name": "Benjamin",
    "last_name": "Ross",
    "email": "Benjamin@test.com",
    "auto_collection": "on",
    "net_term_days": 0,
    "allow_direct_debit": false,
    "created_at": 1412101845,
    "taxability": "taxable",
    "updated_at": 1506418801,
    "resource_version": 1506418801000,
    "deleted": false,
    "object": "customer",
    "card_status": "valid",
    "contacts": [
      {
        "id": "d334f4g45",
        "first_name": "aasca",
        "last_name": "asas",
        "email": "sss@wss.asc",
        "label": "ascasc",
        "enabled": true,
        "send_account_email": true,
        "send_billing_email": false,
        "object": "contact"
      }
    ],
    "primary_payment_source_id": "pm_3Nl8LlrQWK3lpy6b",
    "payment_method": {
      "object": "payment_method",
      "type": "card",
      "reference_id": "cus_BTBvy1z4X6JLhe/card_BTBvztp7M258n7",
      "gateway": "stripe",
      "gateway_account_id": "gw_3Nl8LcOQWK2o5b7N",
      "status": "valid"
    },
    "balances": [
      {
        "promotional_credits": 0,
        "excess_payments": 0,
        "refundable_credits": 0,
        "unbilled_charges": 0,
        "object": "customer_balance",
        "currency_code": "USD"
      }
    ],
    "promotional_credits": 0,
    "refundable_credits": 0,
    "excess_payments": 0,
    "unbilled_charges": 0,
    "preferred_currency_code": "USD"
  },
  "card": {
    "status": "valid",
    "gateway": "stripe",
    "gateway_account_id": "gw_3Nl8LcOQWK2o5b7N",
    "first_name": "Richard",
    "last_name": "Fox",
    "iin": "401288",
    "last4": "1881",
    "card_type": "visa",
    "funding_type": "credit",
    "expiry_month": 10,
    "expiry_year": 2022,
    "issuing_country": "CA",
    "object": "card",
    "masked_number": "************1881",
    "customer_id": "8avVGOkx8U1MX",
    "payment_source_id": "pm_3Nl8LlrQWK3lpy6b"
  }
}